# Pandas DataFrame

In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame(np.arange(20).reshape(5, 4),['A','B','C','D','E'],['W','X','Y','Z'])

In [7]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

Types of selecting Columns

In [11]:
df['W'] #by giving the value of the coloumn name

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [12]:
df.W #by calling the column name
# Not encouraged in coding Practice

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [17]:
df[['W','Y']]  #Can take the needed multiple columns

    W   Y
A   0   2
B   4   6
C   8  10
D  12  14
E  16  18

In [18]:
# each column and row is of Series Data Type
type(df['W'])

pandas.core.series.Series

In [19]:
# pd.series is a Dataframe
type(df)

pandas.core.frame.DataFrame

In [26]:
df.iloc[:, 0]   # we can use iloc method to get the columns with index

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [28]:
df.loc[:, 'W']  #We can use loc method to get the value by giving exact column name

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [44]:
df['NEW']=[1,2,3,4,5]  #Creating a new colum
# thsi will effect the original dataframe

In [45]:
df

    W   X   Y   Z  NEW
A   0   1   2   3    1
B   4   5   6   7    2
C   8   9  10  11    3
D  12  13  14  15    4
E  16  17  18  19    5

In [46]:
df.new_1=[6,7,8,9,10]  #we cannot craete a new column by using dot new column name

In [47]:
df

    W   X   Y   Z  NEW
A   0   1   2   3    1
B   4   5   6   7    2
C   8   9  10  11    3
D  12  13  14  15    4
E  16  17  18  19    5

In [48]:
df.drop('NEW', axis=1)  #This is used to delete the row from data frame
# This will not effect teh original dataframe
# axis =0 means row, axis =1 means columns

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [49]:
df

    W   X   Y   Z  NEW
A   0   1   2   3    1
B   4   5   6   7    2
C   8   9  10  11    3
D  12  13  14  15    4
E  16  17  18  19    5

In [50]:
# if we want to permanently delete the column use inplace parameter by default it is false
# axis by default it is 0

df.drop('NEW',axis=1,inplace=True)

In [40]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

Selecting the rows from a DataFrame

In [51]:
# we have 2 methods offcially to select the rows from a dataframe
# loc (location based)
# iloc (index based)

In [52]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [55]:
df.loc['A']

W    0
X    1
Y    2
Z    3
Name: A, dtype: int32

In [56]:
df.iloc[0]

W    0
X    1
Y    2
Z    3
Name: A, dtype: int32

Finding Subsets of a Data Frame

In [58]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [65]:
df.loc['A','Y']

2

In [66]:
df.loc['C','X']

9

In [67]:
df.loc[['B','C'],['X','Y']]

   X   Y
B  5   6
C  9  10